{"data":{"methods":[["Motivate yourself to win. Before the race even starts, you should have an, \"I will do well,\" mindset. If you don't think you will do well you won't do well.","Focus on the finish line. Once you can see the finish line, you should be running all out. Don't worry about coming up short. It's better to try to fail than to never try at all.","If you are in front, don't bother looking behind you. You can tell if someone's behind you by listening to their breathing and footsteps. Looking back will only slow you down. Instead, think, \"this person isn't beating me,\" and run as fast as your legs will carry you.","If you are coming from behind, don't worry about how far behind you are. Try to catch up to them anyway. While you may not win, it will improve your time and keep others from passing you. Have that same, \"this person isn't beating me,\" mindset and run as fast as your legs will carry you.","Right before you pass the finish line, bend down so your chest passes before your legs. The officials usually stop the clock as the runner's chest passes the finish line, not their legs, as it would be harder to tell who won in a close call. This could make the difference between 1st and 2nd place. (See the picture of the bunny.) Do this in races that don´t use time chips. When you are in a race that uses time chips thrust the foot that has the time chip first to lose some extra milliseconds.","Say \"good job\" and shake the hand of the person you were neck and neck with at the end of the race.","Make sure you get some water, cool down, and stretch. If you have another event, go to that event.","Evaluate yourself after the race. If you felt like you had energy to do another lap at the end, you should have probably kicked sooner. But, if you are exhausted and feel pushed to your limit, you probably kicked at the right time.","Good Luck!","Get adrenaline for the last few meters and go all the way pretend that the finish line is a few meters back that way you sprint all the way to the end."]],"methodsImages":[["https://www.wikihow.com/images/thumb/5/54/Run-a-1600M-Race-Step-1.jpg/v4-728px-Run-a-1600M-Race-Step-1.jpg","https://www.wikihow.com/images/thumb/6/61/Run-400-Meters-Step-2.jpg/v4-728px-Run-400-Meters-Step-2.jpg","https://www.wikihow.com/images/thumb/5/58/Run-a-Faster-1500-Meter-Step-13.jpg/v4-728px-Run-a-Faster-1500-Meter-Step-13.jpg","https://www.wikihow.com/images/thumb/6/60/Enjoy-Jogging-Step-2.jpg/v4-728px-Enjoy-Jogging-Step-2.jpg","https://www.wikihow.com/images/thumb/7/7d/Run-a-5-Minute-Mile-Step-3.jpg/v4-728px-Run-a-5-Minute-Mile-Step-3.jpg","https://www.wikihow.com/images/thumb/9/9e/%22Kick-It%22-in-the-End-of-a-Race-Step-6.jpg/v4-728px-%22Kick-It%22-in-the-End-of-a-Race-Step-6.jpg","https://www.wikihow.com/images/thumb/8/8e/Prevent-a-Cold-Sore-from-Forming-Step-3.jpg/v4-728px-Prevent-a-Cold-Sore-from-Forming-Step-3.jpg","https://www.wikihow.com/images/thumb/d/df/Be-a-Good-Sprinter-Step-6.jpg/v4-728px-Be-a-Good-Sprinter-Step-6.jpg","https://www.wikihow.com/images/thumb/b/b0/Be-a-Good-Sprinter-Step-5.jpg/v4-728px-Be-a-Good-Sprinter-Step-5.jpg","https://www.wikihow.com/images/thumb/a/a9/Improve-Your-5K-Race-Time-Step-3.jpg/v4-728px-Improve-Your-5K-Race-Time-Step-3.jpg"]],"articleTitle":"How to \"Kick It\" in the End of a Race","articleUrl":"https://www.wikihow.com/%22Kick-It%22-in-the-End-of-a-Race","articleId":138527,"topLevelCategories":["Sports and Fitness"],"hasSummary":false,"summaryText":"","summaryVideoUrl":"","lifeHack":"","lifeHackImageUrl":""}}