{"data":{"methods":[["Form a group outside of your favorite World of Warcraft instance. If your character is level 60, look for groups interested in Blackrock Depths (BRD), Molten Core (MC), Scholomance (Scholo), or Zul'Gurub (ZG). These instances are great for Ninja Looting. Note: for level 70s go to Karazhan, the black temple, gruul etc..","Keep in mind once you have started a party or group for the instance, make the players feel comfortable with your character by throwing a joke or two. Get the group laughing.","Remember now that you've built a pact of trust, continue the instance without saying a word. When it comes time to roll on drop, make sure to Greed roll, because the risk of being spotted increases with a Need roll. So if you are thinking about \"needing\" on that Green item, DON'T. And never EVER roll need on a green item. if you really do need a green item ask the group politely if you could roll need. If other players need the item too then it doesn't matter, it might drop later, or a better item might drop later in the instance.","Note that depending on the instance, you may encounter several Mini-Bosses. These bosses are not to be Ninja Looted because their drops are not worth getting blacklisted over. If you are thinking about Ninja Looting them, simply DON'T.","Remember when it comes time for the instance boss, your group will form a huddle. In this huddle a guild will call out strategies and tactics for taking down the boss.","Note that, as explained above, the strategy will probably not work, but you must adhere to it. Straying from the plan is a surefire way of getting yourself heat. This is not what a Ninja Looter wants.","Remember your group has worked hard, and they may be rejoicing. Do not give into the /dance commands or /trains. Make sure that you are focused on the corpse you just downed.","Keep this step in mind, because it is important! Spark controversy right before the Ninja Loot. This will serve as your distraction. Ninja Looters most often blame others for Need rolling on Materials right before they go in for the Ninja Loot.","Know the Ninja Loot: As the group begins to argue and/or discuss your claim, disband from your group, and hold shift as your right click on the downed boss's corpse. This will ensure that all contents of the corpse are delivered to you in one click. It is important to IMMEDIATELY use Hearthstone and log afterwards."]],"methodsImages":[["https://www.wikihow.com/images/thumb/4/41/%22Ninja-Loot%22-in-World-of-Warcraft-Step-1.jpg/v4-728px-%22Ninja-Loot%22-in-World-of-Warcraft-Step-1.jpg","https://www.wikihow.com/images/thumb/5/58/%22Ninja-Loot%22-in-World-of-Warcraft-Step-2.jpg/v4-728px-%22Ninja-Loot%22-in-World-of-Warcraft-Step-2.jpg","https://www.wikihow.com/images/thumb/4/4f/%22Ninja-Loot%22-in-World-of-Warcraft-Step-3.jpg/v4-728px-%22Ninja-Loot%22-in-World-of-Warcraft-Step-3.jpg","https://www.wikihow.com/images/thumb/d/df/%22Ninja-Loot%22-in-World-of-Warcraft-Step-4.jpg/v4-728px-%22Ninja-Loot%22-in-World-of-Warcraft-Step-4.jpg","https://www.wikihow.com/images/thumb/8/86/%22Ninja-Loot%22-in-World-of-Warcraft-Step-5.jpg/v4-728px-%22Ninja-Loot%22-in-World-of-Warcraft-Step-5.jpg","https://www.wikihow.com/images/thumb/e/e7/%22Ninja-Loot%22-in-World-of-Warcraft-Step-6.jpg/v4-728px-%22Ninja-Loot%22-in-World-of-Warcraft-Step-6.jpg","https://www.wikihow.com/images/thumb/c/ca/%22Ninja-Loot%22-in-World-of-Warcraft-Step-7.jpg/v4-728px-%22Ninja-Loot%22-in-World-of-Warcraft-Step-7.jpg","https://www.wikihow.com/images/thumb/f/fc/%22Ninja-Loot%22-in-World-of-Warcraft-Step-8.jpg/v4-728px-%22Ninja-Loot%22-in-World-of-Warcraft-Step-8.jpg","https://www.wikihow.com/images/thumb/9/98/%22Ninja-Loot%22-in-World-of-Warcraft-Step-9.jpg/v4-728px-%22Ninja-Loot%22-in-World-of-Warcraft-Step-9.jpg"]],"articleTitle":"How to \"Ninja Loot\" in World of Warcraft","articleUrl":"https://www.wikihow.com/%22Ninja-Loot%22-in-World-of-Warcraft","articleId":42264,"topLevelCategories":["Hobbies and Crafts"],"hasSummary":false,"summaryText":"","summaryVideoUrl":"","lifeHack":"","lifeHackImageUrl":""}}